$('document').ready(function(){
var elements = document.querySelector('.B');
elements.addEventListener("change", work);
function work() {
  var choice = elements.value;

  if (choice === '0') {
    $('.C').prepend('<option value="01.03.02">01.03.02 - Прикладная информатика и математика</option>');
	$('.C').prepend('<option value="09.03.02">09.03.02 - Информационные системы и технологии в бизнесе</option>');
	$('.C').prepend('<option value="09.03.03">09.03.03 - Прикладная информатика</option>');
	$('.C').prepend('<option value="09.03.03.01">09.03.03.01 - Прикладная информатика в экономике</option>');
	$('.C').prepend('<option value="01.03.02">01.03.02 - Бакалавриат - 10.03.01 - Информационная безопасность</option>');
	$('.C').prepend('<option value="27.03.02">27.03.02 - Управление качеством</option>');
	$('.C').prepend('<option value="38..03.01.01">38..03.01.01 - Бухгалтерский учет, анализ и аудит</option>');
	$('.C').prepend('<option value="38.03.01.02">38.03.01.02 - Экономика преприятий и организаций</option>');
	$('.C').prepend('<option value="38.03.01.03">38.03.01.03 - Банковское дело</option>');
	$('.C').prepend('<option value="38.03.01.04">38.03.01.04 - Мировая экономика</option>');
	$('.C').prepend('<option value="38.03.01.05">38.03.01.05 - Налоги и налогооблажение</option>');
	$('.C').prepend('<option value="38.03.01.06">38.03.01.06 - Статистика</option>');
	$('.C').prepend('<option value="38.03.01.07">38.03.01.07 - Финансы и кредит</option>');
	$('.C').prepend('<option value="38.03.01.09">38.03.01.09 - Бизнес-анализ и прогназирование в организациях</option>');
	$('.C').prepend('<option value="38.03.01.10">38.03.01.10 - Региональная экономика</option>');
	$('.C').prepend('<option value="38.03.01.11">38.03.01.11 - Анализ и управление рисками</option>');
	$('.C').prepend('<option value="38.03.01.12">38.03.01.12 - Банковское дело и денежное обращене</option>');
	$('.C').prepend('<option value="38.03.01.13">38.03.01.13 - Финансовая безопасность</option>');
  } else if (choice === '1') {
    
  } else if (choice === '2') {
    $('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
	$('.C').prepend('<option value="01.04.02">01.04.02 - Прикладная математика и информатика</option>');
  } else if (choice === '3') {
    
  } else {}
}
})